# -*- coding: utf-8 -*-
# Author: XuMing <xuming624@qq.com>
# Brief:
import sys
sys.path.append("../")
from pycorrector import corrector

error_sentences = [
    # '应为他学得很好，所以同班同学都喜欢问他问题。',
    # '身体建錓。',
    # '因为在我的家每天早上没吃东西，我非吃不可，要不然我死定了吧！',
    # '王大卫总于上他第一天的中文课。',
    '不过在许多传统文化的国家，女人向未得到平等。',
    # '上个周末以前我打算去城市完，可是周末到了因为天气很好我觉得去乡下比较好。',
    # '不好意思，可是我觉得我那时间不能参加，因为我已经跟我的弟弟打算去台玩。',
    # '下个星期，我跟我朋唷打算去法国玩儿。',
    # '到电影院前面，他们一定先要买票在可以进去。',
    # '我要跟我的朋友一起去市大夜市吃晚饭。',
    # '我也知道你喜欢米兰队，可是我想买国几米兰队的衣，请不要生我的气。',
    # '我要你去到遭级市场买一本中文（它介绍德国文化），第二个东司是一个电视。',
    # '我等你的答案，习惯你下个月也有时间。',
    # '我明天不能跟你一起丢看电影。',
    # '应为他学得很好，所以同班同学都喜欢问他问题。',
    # '美美说应为学校没有冷气，所以今天教室里面热得不得了。',
    # '我以前想要高诉你，可是我忘了。我真户秃。',
    # '我那时候也再一家劳务出口公司担任开发市场职务。',
    # '高心',
    # # '很不做',
    # '比塞。',
    # '请座。',
    # '平干',
    # '听到有人叫们。',
    # '第一位京第二位，他说：第二位利好。',
    # '我准备一些面包给他吃，我也从冰箱拿出来了埤酒',
    # '所以我很高心',
    # '请我座在沙发上',
    # '美食美事皆不可辜负，这场盛会你一定期待已久',
    # '点击咨询痣疮是什么原因?咨询医师痣疮原因',
    # '附睾焱的症状?要引起注意!',
    # '外阴尖锐涅疣怎样治疗?-济群解析',
    # '洛阳大华雅思 30天突破雅思7分',
    # '男人不育少靖子症如何治疗?专业男科,烟台京城医院',
    # '疝気医院那好 疝気专科百科问答',
    # '成都医院治扁平苔鲜贵吗_国家2甲医院',
    # '少先队员因该为老人让坐',
    # '服装店里的衣服各试各样',
    # '一只小鱼船浮在平净的河面上',
    # '我的家乡是有明的渔米之乡',
    # ' _ ,',
    # '我对于宠物出租得事非常认同，因为其实很多人喜欢宠物',  # 出租的事
    # '有了宠物出租地方另一方面还可以题高人类对动物的了解，因为那些专业人氏可以指导我们对于动物的习惯。',  # 题高 => 提高 专业人氏 => 专业人士
    # '三个凑皮匠胜过一个诸葛亮也有道理。',  # 凑
    # '还有广告业是只要桌子前面坐者工作未必产生出来好的成果。',
]
for line in error_sentences:
    print("starting correction...")
    correct_sent = corrector.correct(line)
    print("original sentence:{} => correct sentence:{}".format(line, correct_sent))




